BFS/example/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

application     chtMultiRegionTwoPhaseEulerFoamCustomized;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          0.1;

writeControl    adjustableRunTime;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  9;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.08;

maxDeltaT       0.5;

maxDi           0.5;

functions
{
    probes_fluidU
    {
        libs ( "libsampling.so" );

        type    probes;
        name    probes_fluidU;
        region  fluid;
        writeControl    timeStep;
        writeInterval   1;
        fields
        (
            U.liquid
        );

        probeLocations
        (
            (0.6 -0.33 0.1)
            (4.2 -0.33 0.1)
            (29 -0.33 0.1)
            (3.9 0.30 0.1)
            (5.1 -0.12 0.1)
        );
    }
    
    probes_fluidT
    {
        libs ( "libsampling.so" );

        type    probes;
        name    probes_fluidT;
        region  fluid;
        writeControl    timeStep;
        writeInterval   1;
        fields
        (
            T.liquid
        );

        probeLocations
        (
            (0.6 -0.33 0.1)
            (4.2 -0.33 0.1)
        );
    }

    probes_solid
    {
        libs ( "libsampling.so" );

        type    probes;
        name    probes_solid;
        region  solid;
        writeControl    timeStep;
        writeInterval   1;
        fields
        (
            T
        );

        probeLocations
        (
            (0.2 -0.52 0.1)
            (4.5 -0.52 0.1)
            (29 -0.52 0.1)
        );
    }
             
    yPlusPhaseLiquid
    {
        type            yPlusPhase;
        region          fluid;
        libs            ( "libfieldFunctionObjectsCustomized" );
        phase           liquid;
        result          yPlus.liquid;
        writeControl    writeTime;
    }
    yPlusPhaseGas
    {
        type            yPlusPhase;
        region          fluid;
        libs            ( "libfieldFunctionObjectsCustomized" );
        phase           gas;
        result          yPlus.gas;
        writeControl    writeTime;
    }
    wallHeatFluxSolid
    {
        type            wallHeatFluxPhase;
        region          solid;
        libs            ( "libfieldFunctionObjectsCustomized" );
        result          wallHeatFlux;
        writeControl    writeTime;
        patches         (solid_to_fluid);
    }
    wallHeatFluxLiquid
    {
        type            wallHeatFluxPhase;
        region          fluid;
        libs            ( "libfieldFunctionObjectsCustomized" );
        phase           liquid;
        result          wallHeatFlux.liquid;
        writeControl    writeTime;
        patches         (fluid_to_solid);
    }
    wallHeatFluxGas
    {
        type            wallHeatFluxPhase;
        region          fluid;
        libs            ( "libfieldFunctionObjectsCustomized" );
        phase           gas;
        result          wallHeatFlux.gas;
        writeControl    writeTime;
        patches         (fluid_to_solid);
    }
    Tfluid
    {
        type            TFluid;
        region          fluid;
        libs            ( "libfieldFunctionObjectsCustomized" );
        phase           liquid;
        otherPhase      gas;
        result          TFluid;
        writeControl    writeTime;
        patches         (fluid_to_solid);
    }
}

// ************************************************************************* //
